# pandas基础

In [1]:
pwd

'C:\\Users\\Administrator\\ai_alg\\pandas'

## 1. 概况
功能： 就是为了让数据分析变得容易。
基本数据结构（2种）： Series, DataFrame.
基于NumPy.
特征： 动态统计， 对缺失的数据进行处理。

In [17]:
from pandas import Series, DataFrame
import pandas as pd

import numpy as np

## 2. Series

In [6]:
obj = Series([1,1,2,3,5])

In [7]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj.values

array([1, 1, 2, 3, 5], dtype=int64)

In [9]:
obj

0    1
1    1
2    2
3    3
4    5
dtype: int64

In [10]:
obj = Series([1,1,2,3,5], index =["a","b","c","d","e"])

In [11]:
obj

a    1
b    1
c    2
d    3
e    5
dtype: int64

In [12]:
obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

可以用布尔索引提取某些行。

In [13]:
obj[obj <3]

a    1
b    1
c    2
dtype: int64

In [14]:
obj *2

a     2
b     2
c     4
d     6
e    10
dtype: int64

In [15]:
obj ** 3

a      1
b      1
c      8
d     27
e    125
dtype: int64

In [18]:
np.cos(obj)

a    0.540302
b    0.540302
c   -0.416147
d   -0.989992
e    0.283662
dtype: float64

In [19]:
np.exp(obj)

a      2.718282
b      2.718282
c      7.389056
d     20.085537
e    148.413159
dtype: float64

可以通过字典来创建Series

In [21]:
data = {"Chengdu": 2000,"Shanghai":3000,"Xian": 4000}
obj2 = Series(data)

In [22]:
obj2

Chengdu     2000
Shanghai    3000
Xian        4000
dtype: int64

In [26]:
cities = ["Chongqing","Xian","Shanghai","Xiamen"]
obj3 = Series(data, index=cities)

In [27]:
obj3

Chongqing       NaN
Xian         4000.0
Shanghai     3000.0
Xiamen          NaN
dtype: float64

检查数据是否为空的函数：

In [28]:
pd.isnull(obj3)

Chongqing     True
Xian         False
Shanghai     False
Xiamen        True
dtype: bool

## 序列的自动对齐

In [29]:
obj = Series(data)
obj

Chengdu     2000
Shanghai    3000
Xian        4000
dtype: int64

In [30]:
data2 = {"Chengdu": 2000,"Guangzhou":3500,"Xian": 4000}
obj2 = Series(data2)
obj2

Chengdu      2000
Guangzhou    3500
Xian         4000
dtype: int64

In [31]:
obj + obj2

Chengdu      4000.0
Guangzhou       NaN
Shanghai        NaN
Xian         8000.0
dtype: float64

### name 属性

In [32]:
obj.name = "income"
obj.index.name = "cities"
obj

cities
Chengdu     2000
Shanghai    3000
Xian        4000
Name: income, dtype: int64

In [33]:
obj2

Chengdu      2000
Guangzhou    3500
Xian         4000
dtype: int64

In [34]:
obj2.index = ["CD","GZ","XA"]

In [35]:
obj2

CD    2000
GZ    3500
XA    4000
dtype: int64

### DataFrame基础

创建DataFrame

In [36]:
data3 = {'city': ['Xian','Chongqing','Fuzhou','Xiamen'],'income': ['3000','2800','2600','4000'] }
df = DataFrame(data3)

In [37]:
df

        city income
0       Xian   3000
1  Chongqing   2800
2     Fuzhou   2600
3     Xiamen   4000

In [38]:
data2 = {'city': ['Chengdu','Chongqing','Fuzhou','Xiamen'],'income': ['3000','2800','2600','4000']}
df2 = DataFrame(data2)
df2

        city income
0    Chengdu   3000
1  Chongqing   2800
2     Fuzhou   2600
3     Xiamen   4000

In [39]:
df + df2

                 city    income
0         XianChengdu  30003000
1  ChongqingChongqing  28002800
2        FuzhouFuzhou  26002600
3        XiamenXiamen  40004000

In [40]:
data2 = {'city': ['Chengdu','Chongqing','Fuzhou','Xiamen'],'income': [3000,2800,2600,4000]}
df2 = DataFrame(data2)
data3 = {'city': ['Xian','Chongqing','Fuzhou','Xiamen'],'income': [3000,2800,2600,4000] }
df = DataFrame(data3)
df + df2

                 city  income
0         XianChengdu    6000
1  ChongqingChongqing    5600
2        FuzhouFuzhou    5200
3        XiamenXiamen    8000

In [42]:
df3 = DataFrame(data2, columns = ["income","city","population"])

In [43]:
df3["city"]

0      Chengdu
1    Chongqing
2       Fuzhou
3       Xiamen
Name: city, dtype: object

In [44]:
df.city

0         Xian
1    Chongqing
2       Fuzhou
3       Xiamen
Name: city, dtype: object

In [45]:
DataFrame(data2, columns = ["income","city","population"])['income']

0    3000
1    2800
2    2600
3    4000
Name: income, dtype: int64

In [46]:
df3.ix[0]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

income           3000
city          Chengdu
population        NaN
Name: 0, dtype: object

In [47]:
df3

   income       city population
0    3000    Chengdu        NaN
1    2800  Chongqing        NaN
2    2600     Fuzhou        NaN
3    4000     Xiamen        NaN

In [55]:
df4 = DataFrame(data2, columns =['city','income','population'] )
df4

        city  income population
0    Chengdu    3000        NaN
1  Chongqing    2800        NaN
2     Fuzhou    2600        NaN
3     Xiamen    4000        NaN

In [56]:
df4['population']

0    NaN
1    NaN
2    NaN
3    NaN
Name: population, dtype: object

In [53]:
df4["population"] = 4000

In [52]:
df4

        city  income  population
0    Chengdu    3000        4000
1  Chongqing    2800        4000
2     Fuzhou    2600        4000
3     Xiamen    4000        4000

In [57]:
gdp = {'Chengdu':{'2000':30,'2005':45,'2010':69},'Chongqing':{'2000':25,'2005':35,'2010':60} ,'Fuzhou': {'2000':30,'2005':42,'2010':60},'Xiamen':{'2000':39,'2005':43,'2010':55} } 
df5 = DataFrame(gdp)
df5

      Chengdu  Chongqing  Fuzhou  Xiamen
2000       30         25      30      39
2005       45         35      42      43
2010       69         60      60      55

In [58]:
df5.T

           2000  2005  2010
Chengdu      30    45    69
Chongqing    25    35    60
Fuzhou       30    42    60
Xiamen       39    43    55

In [59]:
df6 = df5.T
df6["2000"]

Chengdu      30
Chongqing    25
Fuzhou       30
Xiamen       39
Name: 2000, dtype: int64

In [60]:
df5.values

array([[30, 25, 30, 39],
       [45, 35, 42, 43],
       [69, 60, 60, 55]], dtype=int64)

In [61]:
df5

      Chengdu  Chongqing  Fuzhou  Xiamen
2000       30         25      30      39
2005       45         35      42      43
2010       69         60      60      55

In [66]:
df5.index.name = 'year'

In [67]:
df5.columns.name = 'city'

In [68]:
df5

city  Chengdu  Chongqing  Fuzhou  Xiamen
year
2000       30         25      30      39
2005       45         35      42      43
2010       69         60      60      55

In [69]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 2000 to 2010
Data columns (total 4 columns):
Chengdu      3 non-null int64
Chongqing    3 non-null int64
Fuzhou       3 non-null int64
Xiamen       3 non-null int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [73]:
df5.Chongqing.astype('str')

In [78]:
 obj5 = Series([4,6, 8], index = [0,2,4])

In [79]:
obj5

0    4
2    6
4    8
dtype: int64

In [80]:
obj5.reindex(range(6), method='ffill')

0    4
1    4
2    6
3    6
4    8
5    8
dtype: int64

In [81]:
obj5.reindex(range(6), method='bfill')

0    4.0
1    6.0
2    6.0
3    8.0
4    8.0
5    NaN
dtype: float64

In [82]:
obj

cities
Chengdu     2000
Shanghai    3000
Xian        4000
Name: income, dtype: int64

In [83]:
obj = Series([1,2,3,4,5], index=["a","b","c","d","e"])

In [84]:
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [85]:
obj[[1,4]]

b    2
e    5
dtype: int64

In [86]:
obj[[1,4]][obj <4]

b    2
dtype: int64

In [87]:
obj["a" : "d"]

a    1
b    2
c    3
d    4
dtype: int64

In [88]:
 obj['b':'e'] = 0

In [89]:
obj

a    1
b    0
c    0
d    0
e    0
dtype: int64

In [90]:
df4

        city  income population
0    Chengdu    3000        NaN
1  Chongqing    2800        NaN
2     Fuzhou    2600        NaN
3     Xiamen    4000        NaN

In [91]:
df4.income

0    3000
1    2800
2    2600
3    4000
Name: income, dtype: int64

In [94]:
df4[["income", "city", "city"]]

   income       city       city
0    3000    Chengdu    Chengdu
1    2800  Chongqing  Chongqing
2    2600     Fuzhou     Fuzhou
3    4000     Xiamen     Xiamen

In [95]:
data = DataFrame(np.arange(16).reshape((4,4)), index = ['CD','CQ', 'GZ', 'XM'], columns = ['One', 'Two', 'Three', 'Four'] )
data

    One  Two  Three  Four
CD    0    1      2     3
CQ    4    5      6     7
GZ    8    9     10    11
XM   12   13     14    15

In [96]:
data[[True, False,False, False]]

    One  Two  Three  Four
CD    0    1      2     3

In [97]:
data[data['Four'] > 10]

    One  Two  Three  Four
GZ    8    9     10    11
XM   12   13     14    15